{
  "nav.practiceAreas": "Practice Areas",
  "nav.about": "About",
  "nav.ourTeam": "Our Team",
  "nav.resources": "Resources",
  "nav.news": "News",
  "nav.articles": "Articles",
  "nav.contact": "Contact",
  "nav.chatWithEve": "Chat with Eve",
  "nav.altLogo": "Avid Law Logo",

  "exploreButton.explore": "Explore",

  "practiceAreas.familyLaw": "Family Law",
  "practiceAreas.corporateCommercialLaw": "Corporate & Commercial Law",
  "practiceAreas.civilLitigation": "Civil Litigation",
  "practiceAreas.conveyancing": "Real Estate Transaction",
  "practiceAreas.willsTrustEstates": "Trusts, Wills & Estates",

  "practiceAreas.prenuptialAgreement": "Prenuptial Agreement",
  "practiceAreas.separationDivorceAgreement": "Separation Agreement",
  "practiceAreas.matrimonialPropertiesDivision": "Divorce Property Division",
  "practiceAreas.childSupport": "Child Custody",
  "practiceAreas.spouseSupport": "Child Support",
  "practiceAreas.divorceOrder": "Child Guardianship",
  "practiceAreas.divorceLitigation": "Children's Visitation Rights",
  "practiceAreas.incorporationMaintenance": "Spousal Support",
  "practiceAreas.commercialContractDrafting": "Divorce Proceedings",

  "practiceAreas.employmentContract": "Company Registration, Maintenance",
  "practiceAreas.shareholderAgreement": "Various Commercial Contracts",
  "practiceAreas.partnershipAgreement": "Employment Contract",
  "practiceAreas.purchaseSaleBusinesses": "Shareholder Agreement, Partnership Agreement",
  "practiceAreas.commercialLending": "M&A Business",
  "practiceAreas.corporateRestructuring": "Commercial Loans",
  "practiceAreas.franchiseAgreement": "Corporate Restructuring",
  "practiceAreas.defamation": "Enterprise Joining",
  "practiceAreas.debtCollection": "Enterprise Agency",

  "practiceAreas.shareholderDisputes": "Defamation",
  "practiceAreas.constructionRealEstateDisputes": "Debt Litigation",
  "practiceAreas.contractDisputes": "Shareholder Dispute",
  "practiceAreas.fraudClaims": "Construction & Land Dispute",
  "practiceAreas.estateLitigations": "Breach of Contract",
  "practiceAreas.residentialPurchaseSale": "Tort, Unjust Enrichment Litigation",

  "practiceAreas.residentialMortgagesRefinancing": "Real Estate Mortgage",
  "practiceAreas.lotrFiling": "Real Estate Transfer",
  "practiceAreas.commercialRealEstatePurchaseSale": "Real Estate Inquiries",
  "practiceAreas.wills": "Application for Read Estate Certificate",
  "practiceAreas.representationAgreements": "LOTR Declaration",

  "practiceAreas.probateWithWithoutWill": "Will & Estate Planning Consultation",
  "practiceAreas.estatePlanning": "Consulate Document Authentication",
  "practiceAreas.notarization":"Certificate & Document Notarization",
  "practiceAreas.documentAuthenticationEmbassies": "Power of Attorney",
  "practiceAreas.powerOfAttorney": "Apply for Probate",
  "practiceAreas.inheritance": "Inheritance",

  "practiceAreas.closeModal": "Close modal",
  "practiceAreas.pageTitle": "Our Practice Areas",
  "practiceAreas.heroDescription": "Explore the legal expertise we bring to support every stage of your personal or business journey.",
  "practiceAreas.familyLawDescription": "Compassionate guidance through life's most personal legal challenges.",
  "practiceAreas.corporateCommercialLawDescription": "Strategic legal counsel for businesses at every stage of growth.",
  "practiceAreas.civilLitigationDescription": "Skilled representation to protect your interests in court.",
  "practiceAreas.conveyancingDescription": "Seamless property transactions with careful attention to detail.",
  "practiceAreas.willsTrustEstatesDescription": "Comprehensive estate planning to protect your legacy and loved ones.",
  "practiceAreas.eveTitle": "Need help with any of these areas?",

  "about.sectionTitle": "About Avid Law",
  "about.sectionText": "Avid Law is the largest law firm in the Greater Vancouver area founded by Sino-Canadian lawyer. Located in Richmond, we proudly offer legal services in Mandarin, Cantonese, and English.",
  "about.historyTag": "Our History",
  "about.historyText": "Established over 14 years ago, Avid Law has earned a reputation for excellence, reliability, and professional integrity. Originally founded as CNS Law Corporation, our firm merged with Redman Law in June 2021, significantly expanding our capabilities through the synergy of our combined teams.",
  "about.expertiseTag": "Our Expertise",
  "about.expertiseText": "Our firm provides comprehensive legal solutions in family law, real estate transactions, and business law, assisting various companies with their commercial needs. We have nearly 4,000 square feet of modern office space centrally located in downtown Richmond, allowing us to serve our clients effectively and efficiently.",
  "about.serviceTag": "Litigation Services",
  "about.serviceText1": "Our experienced litigation lawyers passionately advocate for our clients at all levels of court, including Small Claims Court, the Provincial Court of British Columbia, the Supreme Court of British Columbia, and the Court of Appeal. We also represent clients before various tribunals, such as the Residential Tenancy Branch, the Employment Standards Branch, and the Federal Court.",
  "about.serviceText2": "We are dedicated to aggressively protecting our clients' interests, thoroughly investigating each case, and ensuring no stone is left unturned. Beyond the courtroom, our team actively seeks alternative dispute resolutions, aiming for efficient and favorable outcomes.",
  "about.solicitorTag": "Solicitor Services",
  "about.solicitorText1": "Our solicitors proactively identify and address potential legal issues through careful planning and tailored agreements. Whether preparing a prenuptial agreement, drafting employment contracts, or handling business purchase and sale transactions, we prioritize strategic legal advice to protect our clients' future interests.",
  "about.solicitorText2": "We firmly believe that investing in preventive legal measures significantly reduces future litigation costs and risks, and we consistently advocate this approach to safeguard our clients' well-being.",
  "about.eveTitle": "Want to Dive Deeper?",
  "about.eveText": "Whether you're curious about the people behind Avid Law or want quick answers about our firm, we've got you covered.",
  "about.eveButton": "Meet Our Team",

  "team.sectionTitle": "Our Team",
  "team.sectionDescription": "Meet the dedicated professionals who make our firm exceptional",
  "team.viewProfile": "View Profile",
  "team.needHelpQuestion": "Not sure which lawyer is right for you?",
  "team.eveDescription": "Let Eve, our AI assistant, guide you to the best-suited lawyer based on your specific legal needs and circumstances.",

  "team.name.AdeleSun": "Adele Sun",
  "team.title.AdeleSun": "Barrister & Solicitor",
  "team.bio.AdeleSun": "Adele Sun graduated from the University of British Columbia with a Juris Doctor (JD). Adele worked for TD Bank Canada as a Senior Financial Analyst for four years before she moved to Vancouver to pursue her legal education. She received a MBA from the Richard Ivey School of Business of University of Western Ontario in 2001. Prior to her immigrating to Canada, Adele had worked in areas including education, marketing, and management in China after she graduated with distinction from Harbin Teachers University of China.",

  "team.name.DavidChen": "David Chen",
  "team.title.DavidChen": "Barrister & Solicitor",
  "team.bio.DavidChen": "David is a shareholder of Avid Law. His practice consists of almost exclusively civil litigation and family litigation and he loves it. Like many others in the same era, he immigrated to Canada with his family when he was at a young age. Grew up in Richmond, he attended UBC for his Bachelor of Science with distinction. He went on to work for Health Canada in Ottawa where his interest in law was sparked.\nDavid worked at the Office of Legislative and Regulatory Modernization in Health Canada where he was reading existing and proposed legislations daily. The work was fascinating and he was set on delving deeper into the legal profession. Fast-tracking a few years, David started his law school at the University of Victoria and later completed his Juris Doctor degree with the University of Ottawa. He articled with a prominent mid-size boutique firm in Ottawa and was called to the Ontario bar before returning to his home province to practice.\nDavid is tremendously proud to be serving the communities in the Lower Mainland and Okanagan. During his spare time, if any at all, he can be found hiking and camping at different parks and lakes in the province.",

  "team.name.BrentDesruisseaux": "Brent Desruisseaux",
  "team.title.BrentDesruisseaux": "Barrister & Solicitor",
  "team.bio.BrentDesruisseaux": "Brent Desruisseaux received his law degree from the University of Alberta in 2014. As a student, he volunteered his time with student legal services and the Edmonton Community Legal Centre providing pro bono legal services. Brent has maintained a general litigation practice following his admission to the Law Society of British Columbia in 2015 – he has successfully represented clients on a variety of civil, family, and criminal law matters. Brent understands that court can be an intimidating prospect for many clients and seeks to put them at ease by carefully explaining their rights and the range of possible outcomes. He finds immense personal and professional satisfaction protecting his clients' interests and helping them navigate the justice system. Although he believes his clients are usually best served by negotiating a fair settlement, there are times when it is necessary to forcefully advocate in the courtroom. In his free time, Brent enjoys gardening and exploring the great outdoors with his family.",

  "team.name.CoreyPoon": "Corey Poon",
  "team.title.CoreyPoon": "Barrister & Solicitor",
  "team.bio.CoreyPoon": "Corey earned his Bachelor of Arts in Philosophy at the University of British Columbia. In 2021, Corey completed his Juris Doctor (Law) at Thompson Rivers University where he was a founding member of the Criminal Law Club. In his spare time, Corey enjoys busking and volunteering in the community. Corey has served as a summer clinician at the Law Students' Legal Advice Program representing low-income clients as well as volunteering at George Pearson Centre for the elderly.",

  "team.name.HowardQu": "Howard Qu",
  "team.title.HowardQu": "Barrister & Solicitor",
  "team.bio.HowardQu": "Howard advised clients on a broad range of matters related to multiple levels of courts and tribunals. He engaged in contract, corporate, tenancy, estate, family, property, tort, and other areas of law. Howard graduated from the University of Windsor with a Juris Doctor Degree. Howard is fluent in English and Mandarin.",

  "team.name.FrejaLi": "Freja Li",
  "team.title.FrejaLi": "Barrister & Solicitor",
  "team.bio.FrejaLi": "Prior to joining the Avid Law, Freja was an officer of a private equity management corporation in Vancouver. Freja completed her Master Degree of Laws at McGill University in 2020. Before that, she obtained a Bachelor Degree of Laws in China and interned as a legal assistant of the Executive Director of All China Lawyers Association. The previous educational and work experience enabled her to develop a good understanding of the laws of those two countries and expanded her ability to prioritize and manage multiple tasks under pressure.",

  "team.name.RachelLi": "Rachel Li",
  "team.title.RachelLi": "Barrister & Solicitor",
  "team.bio.RachelLi": "Rachel was born and raised in mainland China. After graduating from one of the top journalism schools in China, she pursued a master's degree in international journalism studies in Hong Kong. Her career started in Hong Kong as a journalist and editor for the national leading news agency in its Asian-Pacific bureau. Prior to attending law school, Rachel worked as a policy researcher in the Hong Kong legislator's office where she accumulated extensive experience in public policy analysis and legislative scrutiny. Rachel is proficient in Mandarin, English, and Cantonese.",

  "team.name.FarrahYang": "Farrah Yang",
  "team.title.FarrahYang": "Paralegal",
  "team.bio.FarrahYang": "Farrah has a Paralegal Certificate with a focus on Family Law and 10 years of experience as a legal assistant in the areas of family law, corporate law, civil litigation and conveyance.",

  "team.name.AshleyWong": "Ashley Wong",
  "team.title.AshleyWong": "Legal Assistant",
  "team.bio.AshleyWong": "Ashley graduated from Birmingham City University in Business Administration; she also holds a Diploma in Legal Studies (Professional Stream) from Hong Kong University School of Professional and Continuing Education. She speaks Cantonese, Mandarin and English.",

  "team.name.JeannieLee": "Jeannie Lee",
  "team.title.JeannieLee": "Legal Assistant",
  "team.bio.JeannieLee": "Jeannie is mainly responsible for real-estate conveyance; she speaks both English and Korean.",

  "team.name.StellaLi": "Stella Li",
  "team.title.StellaLi": "Legal Assistant",
  "team.bio.StellaLi": "Stella graduated from Simon Fraser University; in her spare time, she likes to travel.",

  "team.name.SunnyZhang": "Sunny Zhang",
  "team.title.SunnyZhang": "Legal Assistant",
  "team.bio.SunnyZhang": "Sunny is responsible for the front desk.",

  "team.name.AbielKwok": "Abiel Kwok",
  "team.title.AbielKwok": "Barrister & Solicitor",

  "team.name.NicoleTam": "Nicole Tam",
  "team.title.NicoleTam": "Barrister & Solicitor",

  "team.name.OliviaNicolaides": "Olivia Nicolaides",
  "team.title.OliviaNicolaides": "Barrister & Solicitor",

  "team.name.SarahYan": "Sarah Yan",
  "team.title.SarahYan": "Legal Assistant",

  "team.name.DianaGao": "Diana Gao",
  "team.title.DianaGao": "Accountant",

  "team.name.Lynn": "Lynn",
  "team.title.Lynn": "OIC",

  "team.name.RichardZhu": "Richard Zhu",
  "team.title.RichardZhu": "IT Assistant",

  "hero.title": "WE GET THINGS DONE",
  "hero.subtitle": "Legal expertise you can trust",
  "hero.chatButton": "Chat with Eve",

  "intro.companyName": "AVID LAW",
  "intro.historyTag": "HISTORY: AVID LAW ESTABLISHED",
  "intro.year": "2009",
  "intro.sectionTitle": "A Full-Service Richmond Law Firm",
  "intro.sectionText": "With experienced attorneys who can handle a broad range of complex legal issues for businesses, governmental entities, organizations, professionals, and individuals, at the local, regional, and national levels. Through more than 12 years of practicing law, the firm has developed the deep knowledge base and sound judgment that delivers value to our clients.",
  "intro.readMore": "READ MORE",

  "attorneys.sectionTitle": "Our Legal Team",
  "attorneys.sectionText1": "At Avid Law, our legal team is a diverse and dedicated group of professionals committed to delivering quality, efficient, and cost-effective legal services. As the largest Sino-Canadian-founded law firm in Greater Vancouver, we pride ourselves on a multicultural and multilingual approach, serving our clients proficiently in Mandarin, Cantonese, English, Korean, and Spanish.",
  "attorneys.sectionText2": "Since our establishment in Richmond twelve years ago, Avid Law has grown to become one of the most respected law firms in the Chinese community throughout British Columbia's Lower Mainland. Our dedicated lawyers and skilled support staff operate from nearly 4,000 square feet of modern office space centrally located in downtown Richmond, ensuring accessibility and convenience for our clients.",
  "attorneys.sectionText3": "In June 2021, we significantly enhanced our capabilities through a strategic merger between our predecessor, CNS Law Corporation, and Redman Law, combining resources and expertise to deliver unparalleled legal services. Our team excels across various legal disciplines, including family law, real estate, corporate and commercial law, civil litigation, and estate planning.",
  "attorneys.sectionText4": "Our litigators vigorously advocate for clients across all court levels, from Small Claims and the Provincial Court of British Columbia to the Supreme Court and Court of Appeal, as well as in specialized tribunals such as the Residential Tenancy Branch, Employment Standards Branch, and the Federal Court. We are tireless in pursuing our clients' best interests, both inside and outside the courtroom, aiming for efficient, strategic, and favorable outcomes.",
  "attorneys.sectionText5": "Conversely, our solicitors proactively address potential disputes by drafting meticulous agreements that position our clients favorably for the future. Whether negotiating a prenuptial agreement, structuring a business transaction, or providing strategic corporate advice, we firmly believe that proactive legal planning today prevents costly litigation tomorrow.",
  "attorneys.sectionText6": "At Avid Law, your interests come first, and our exceptional team is ready to guide you through every legal challenge with clarity, diligence, and confidence.",
  "attorneys.meetTeam": "MEET OUR TEAM",
  "attorneys.roleManagingPartner": "Managing Partner",
  "attorneys.roleSeniorAssociate": "Senior Associate",
  "attorneys.roleFamilyLawSpecialist": "Family Law Specialist",
  "attorneys.roleCorporateLawSpecialist": "Corporate Law Specialist",
  "attorneys.roleLitigationExpert": "Litigation Expert",
  "attorneys.roleEstatePlanningAttorney": "Estate Planning Attorney",
  "attorneys.roleLegalAssistant": "Legal Assistant",

  "practiceAreas.sectionTitle": "Practice Areas",
  "practiceAreas.sectionSubtitle": "Comprehensive Expertise, Tailored Solutions",
  "practiceAreas.sectionText1": "At Avid Law, our practice areas cover a diverse array of legal disciplines designed to serve clients effectively across a multitude of sectors and industries. Our comprehensive approach enables us to address complex issues in family law, corporate and commercial matters, civil litigation, real estate transactions, wills, trusts, and estates, and estate planning.",
  "practiceAreas.sectionText2": "By leveraging the collective expertise of our multidisciplinary team, we deliver personalized, strategic, and results-oriented solutions tailored to meet each client's unique circumstances. Our commitment to thorough preparation and proactive counseling ensures that we can anticipate and address challenges before they arise, offering cost-effective and practical outcomes.",
  "practiceAreas.sectionText3": "Through years of dedicated service, Avid Law has built a reputation rooted in professionalism, integrity, and unwavering advocacy. We continue to uphold our tradition of excellence, providing a full spectrum of legal services crafted precisely to align with our clients' needs and objectives.",
  "practiceAreas.viewAll": "VIEW ALL PRACTICES",

  "eve.sectionTitle": "Need Help Finding the Right Lawyer?",
  "eve.sectionText": "Let Eve, our AI assistant, guide you. Ask questions or book an appointment with the perfect attorney for your needs.",
  "eve.chatButton": "Chat with Eve",

  "contact.sectionTitle": "Let's Connect",
  "contact.phoneLabel": "Phone:",
  "contact.emailLabel": "Email:",
  "contact.officeHours": "Our team is available Monday through Friday, 8:30 AM - 5:30 PM. We look forward to assisting you with your legal needs.",
  "contact.office1Title": "Pacific Business Centre",
  "contact.office2Title": "Aberdeen Square (Satellite Office)",
  "contact.copyButtonTooltip": "copied to clipboard!",
  "contact.copyFailedTooltip": "Failed to copy to clipboard",
  "contact.copyLabelPhone": "Phone number",
  "contact.copyLabelEmail": "Email",
  "contact.copyLabelAddress1": "Pacific Business Centre address",
  "contact.copyLabelAddress2": "Aberdeen Square address",
  "contact.mapButtonTooltip": "View in Map",

  "footer.copyright": "© {currentYear} Avid Law. All rights reserved."
} 